[{"model": "nv_projects.nvproject", "pk": 1, "fields": {"name": "AI infrastructure for Autonomous Car/Robotics", "description": "NVIDIA DRIVE™ Infrastructure encompasses the complete data center hardware, software, and workflows needed to develop and validate autonomous driving technology—from raw data collection through validation. It provides the building blocks required for neural network development, training and validation, replay, and testing in simulation.", "link": "https://www.nvidia.com/en-us/self-driving-cars/infrastructure/", "person_in_charge": null, "parent_project": null, "room": 1}}, {"model": "nv_projects.nvproject", "pk": 2, "fields": {"name": "Simulate and Create Smart Indoor Robots with the new Isaac SDK Version 2019.3", "description": "The NVIDIA Isaac Software Development Kit (SDK) is the Industry’s first Robotic AI Development Platform with Simulation, Navigation, and Manipulation. The SDK includes Isaac Engine, high-performance robotics algorithm packages (GEMs), hardware reference applications and Isaac Sim for Navigation, a powerful simulation platform.", "link": "https://news.developer.nvidia.com/isaac-sdk-2019-3/", "person_in_charge": null, "parent_project": null, "room": 2}}, {"model": "nv_projects.nvproject", "pk": 3, "fields": {"name": "RAPIDS", "description": "The RAPIDS suite of open source software libraries and APIs gives you the ability to execute end-to-end data science and analytics pipelines entirely on GPUs. Licensed under Apache 2.0, RAPIDS is incubated by NVIDIA® based on extensive hardware and data science science experience. RAPIDS utilizes NVIDIA CUDA® primitives for low-level compute optimization, and exposes GPU parallelism and high-bandwidth memory speed through user-friendly Python interfaces.\r\n\r\nRAPIDS also focuses on common data preparation tasks for analytics and data science. This includes a familiar dataframe API that integrates with a variety of machine learning algorithms for end-to-end pipeline accelerations without paying typical serialization costs. RAPIDS also includes support for multi-node, multi-GPU deployments, enabling vastly accelerated processing and training on much larger dataset sizes", "link": "https://rapids.ai/", "person_in_charge": null, "parent_project": null, "room": 3}}, {"model": "nv_projects.nvproject", "pk": 4, "fields": {"name": "DREAM", "description": "This is the official implementation of \"Camera-to-robot pose estimation from a single image\" (ICRA 2020). The DREAM system uses a robot-specific deep neural network to detect keypoints (typically joint locations) in the RGB image of a robot manipulator. Using these keypoint locations along with the robot forward kinematics, the camera pose with respect to the robot is estimated using a perspective-n-point (PnP) algorithm. For more details, please see our paper and video.", "link": "https://github.com/NVlabs/DREAM", "person_in_charge": null, "parent_project": null, "room": 4}}, {"model": "nv_projects.nvproject", "pk": 5, "fields": {"name": "Optimizing Light Source Perception with Software-Defined AI", "description": "As autonomous driving technology continues to advance, performance and functionality enhancements via software-defined AI are key to implementing the latest capabilities for safer, more efficient operation.", "link": "https://news.developer.nvidia.com/optimizing-light-source-perception-with-software-defined-ai/", "person_in_charge": null, "parent_project": null, "room": 5}}, {"model": "nv_projects.nvproject", "pk": 6, "fields": {"name": "Transforming Standard Video Into Slow Motion with AI", "description": "Deep learning-based system produce high-quality slow-motion videos from a 30-frame-per-second video, outperforming various state-of-the-art methods that aim to do the same.  The researchers will present their work at the annual Computer Vision and Pattern Recognition (CVPR) conference in Salt Lake City, Utah this week.", "link": "https://news.developer.nvidia.com/transforming-standard-video-into-slow-motion-with-ai/", "person_in_charge": null, "parent_project": null, "room": 6}}, {"model": "nv_projects.nvproject", "pk": 7, "fields": {"name": "Landmark Localization", "description": "Landmark localization is a necessary task for accurate and reliable gesture recognition, facial expression recognition, facial identity verification, eye gaze tracking, and more. Unfortunately, labeling images is a manually intensive task and as a result, few landmark datasets with image to landmarks pairs exist that are large enough to train reliable deep neural networks.", "link": "https://news.developer.nvidia.com/improving-landmark-localization-with-a-new-deep-learning-architecture/", "person_in_charge": null, "parent_project": null, "room": 7}}, {"model": "nv_projects.rolesinproject", "pk": 15, "fields": {"user": 2, "project": 5, "role": "TL"}}, {"model": "nv_projects.rolesinproject", "pk": 16, "fields": {"user": 3, "project": 1, "role": "SA"}}, {"model": "nv_projects.rolesinproject", "pk": 19, "fields": {"user": 6, "project": 2, "role": "TL"}}, {"model": "nv_projects.rolesinproject", "pk": 20, "fields": {"user": 7, "project": 3, "role": "QA"}}, {"model": "nv_projects.rolesinproject", "pk": 21, "fields": {"user": 8, "project": 2, "role": "DV"}}, {"model": "nv_projects.rolesinproject", "pk": 22, "fields": {"user": 9, "project": 1, "role": "LA"}}, {"model": "nv_projects.rolesinproject", "pk": 23, "fields": {"user": 10, "project": 5, "role": "PM"}}, {"model": "nv_projects.rolesinproject", "pk": 24, "fields": {"user": 11, "project": 5, "role": "LA"}}, {"model": "nv_projects.rolesinproject", "pk": 25, "fields": {"user": 12, "project": 2, "role": "AL"}}, {"model": "nv_projects.rolesinproject", "pk": 26, "fields": {"user": 13, "project": 3, "role": "AT"}}, {"model": "nv_projects.rolesinproject", "pk": 27, "fields": {"user": 14, "project": 5, "role": "PM"}}, {"model": "nv_projects.rolesinproject", "pk": 28, "fields": {"user": 15, "project": 1, "role": "LA"}}, {"model": "nv_projects.rolesinproject", "pk": 29, "fields": {"user": 16, "project": 3, "role": "QA"}}, {"model": "nv_projects.rolesinproject", "pk": 30, "fields": {"user": 17, "project": 1, "role": "TL"}}, {"model": "nv_projects.rolesinproject", "pk": 31, "fields": {"user": 18, "project": 1, "role": "DV"}}, {"model": "nv_projects.rolesinproject", "pk": 32, "fields": {"user": 19, "project": 1, "role": "SA"}}, {"model": "nv_projects.rolesinproject", "pk": 33, "fields": {"user": 20, "project": 7, "role": "PM"}}, {"model": "nv_projects.nvopenposition", "pk": 1, "fields": {"name": "Senior Software Engineer, Distributed Systems - Kubernetes", "description": "NVIDIA is hiring engineers to scale up its AI Infrastructure. We expect you to have strong programming skills, a deep understanding of software building and packaging, especially related to GO and C++, experience with distributed systems, as well as excellent communication and planning skills. We also welcome out-of-the-box thinkers who can provide new ideas while strong at executing tasks. Expect to be constantly challenged, improving and evolving for the better. You and other engineers in this team will help advance NVIDIA's capacity to build and deploy leading infrastructure solutions for a broad range of AI-based applications that affect core data science. If you're creative, passionate about what you do, autonomous and love having fun, then what are you waiting for, apply today! For two decades, we have pioneered visual computing, the art and science of computer graphics. With our invention of the GPU - the engine of modern visual computing - the field has expanded to encompass video games, movie production, product design, medical diagnosis and scientific research. Today, we stand at the beginning of the next era, the AI computing era, ignited by a new computing model, GPU deep learning.\r\n\r\nWhat you will be doing: \r\n\r\nThis is a fantastic opportunity to join the core group working on AI infrastructure for Autonomous Car/Robotics.\r\n\r\nWe work on building and improving the Distributed computing infrastructure for creating large scale distributed model training\r\n\r\nExpand and optimize job Orchestration Infrastructure(K8s), Scheduler. Solid technical foundation in distributed computing and storage, including significant experience with most of the following: server systems, storage, I/O, networking, and system software\r\n\r\nWork with engineering teams across all of NVIDIA to ensure your software integrates seamlessly up and down the stack.\r\n\r\nWhat we need to see:\r\n\r\nHighly motivated with strong communication skills, you have the ability to work successfully with multi-functional teams, principles and architects and coordinate effectively across organizational boundaries and geographies.\r\n\r\n10+ years of software engineering experience on large-scale production systems. You possess a BS in Computer Science/Engineering/Physics/Mathematics or other comparable Degree or equivalent experience\r\n\r\nExpert level knowledge of a systems programming language (Go, C++, Java) and Solid understanding of Data Structure and Algorithms.\r\n\r\nStrong understanding of Container Orchestration Systems(K8s/Mesos) and Container Technology.\r\n\r\nUnderstanding of performance, security and reliability in complex distributed systems. Familiarity with system level architecture, such as interconnects, memory hierarchy, interrupts, and memory-mapped IO\r\n\r\nWays to stand out from the crowd:\r\n\r\nLarge-scale Distributed System\r\n\r\nStrong hands on knowledge of K8s\r\n\r\nOperational experience in AI Infrastructure\r\n\r\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.", "is_open": true, "project": 1, "skills": [4, 5, 6]}}, {"model": "nv_projects.nvopenposition", "pk": 2, "fields": {"name": "Software Engineer, Robotics Simulation", "description": "We are now looking for a Software Engineer for our Robotics Simulation team!\r\n\r\nIntelligent machines powered by AI computers that can learn, reason and interact with people are no longer science fiction. Today, a self-driving car powered by AI can meander through a country road at night and find its way. An AI-powered robot can learn motor skills through trial and error. This is truly an outstanding time. The era of AI has begun. At NVIDIA, simulation is at the core of everything we do. NVIDIA GPUs and NVIDIA expertise are paving the way for simulation technology to shape the future. By joining our team you will directly contribute to an exciting field surely to change our way of life.\r\n\r\nWhat you will be doing:\r\nYou will work closely with simulation engineers, robotics researchers, and artists to define and deliver a simulation environment that accelerates robotics development.\r\n\r\nYou will build production-quality software that:\r\n\r\nSimulates, trains and tests different types of robots and scales from the edge to the cloud.\r\n\r\nSimulates different physical sensors (camera, lidar, IMU), vehicle and rigid/soft body dynamics.\r\n\r\nGenerates synthetic data (segmentation, bounding boxes, etc.) for perception, navigation and manipulation training.\r\n\r\nEnsures transfer learning from simulation to physical robots.\r\n\r\nProvides a simulation environment to develop intelligent machines that can work closely with people in a safe collaborative manner.\r\n\r\nWhat we need to see:\r\n\r\nPhD, Master's, or Bachelor's degree in Computer Science, Applied Math, or related field.\r\n\r\nSoftware development skills (C++, Python).\r\n\r\nStrong mathematical fundamentals, including linear algebra and calculus.\r\n\r\nExperience with game/physics engine development.\r\n\r\nAmbitious to deliver, eager to learn new things, and strong communication skills.\r\n\r\nWays to stand out from the crowd:\r\n\r\nExperience with ROS, physics simulation software, computer graphics, version control.\r\n\r\nBackground with Docker, Scalable Cloud deployments\r\n\r\nExperience with shipping and supporting software products.\r\n\r\nFamiliar with AI concepts: Supervised Learning, Reinforcement Learning.\r\n\r\nExperience with data-parallel and/or accelerated computing (CUDA, OpenCL).\r\n\r\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and talented people in the world working for us. If you're creative and have a passion for developing and shipping groundbreaking products, we want to hear from you!\r\n\r\nNVIDIA is committed to fostering a diverse work environment and proud to be an equal opportunity employer. As we highly value diversity in our current and future employees, we do not discriminate (including in our hiring and promotion practices) on the basis of race, religion, color, national origin, gender, gender expression , sexual orientation, age, marital status, veteran status, disability status or any other characteristic protected by law.", "is_open": true, "project": 2, "skills": [1, 6, 27, 28, 29, 30, 31]}}, {"model": "nv_projects.nvopenposition", "pk": 3, "fields": {"name": "Senior Data Science Engineer", "description": "Our team is growing to cover the needs of new projects running on NVIDIA Data Platform. Our goal is to ingest, process and report telemetry data from millions of client systems. Our data sources include traditional PC systems, mobile devices and distributed Web services. A large portion of this work is driven by the emerging market of cloud gaming - have you already tried GeForce Now? Join us in building outstanding data models!\r\n\r\nOur data collection processes allow us to capture a lot of records related to user system data, engagement stats and user satisfaction. They lay the foundation for running various Data Analysis and Machine Learning projects using the collected data. Our roadmap includes analysis of QoS and of security breaches in the game streaming, user behaviour profiling, user base segmentation and campaign targeting, planning and execution of A/B experiments, smart personalized recommendations etc. We’re looking for a hard-working, forward-thinking and ambitious engineer to help us grow our solutions. Bring in your knowledge and your experience to deliver the power of Data to our users across the world.", "is_open": true, "project": 1, "skills": [1, 15, 16, 29, 30, 31, 33]}}, {"model": "nv_projects.nvopenposition", "pk": 4, "fields": {"name": "System Software Engineer – Autonomous Driving", "description": "NVIDIA’s deep learning platform has already made a major impact to the field and is broadly used across leading academic institutions, start-ups, and industry, including the world’s largest Internet companies. We need passionate, hard-working and creative people to help us tackle more of these unique opportunities in Autonomous Driving (AD).\r\n\r\nWhat you’ll be doing:\r\n\r\nYou will be working on DRIVE SW middleware of NVIDIA’s Autonomous Driving stack.\r\n\r\nYou will work closely with internal software groups to understand the requirements, design and implementation of DRIVE SW middleware.\r\n\r\nYou will support Tier 1 and OEM customers to integrate NVIDIA DRIVE SW into the customer end product and ensure the program requirements & KPIs are met.\r\n\r\nYou will be part of an internationally distributed team with remote locations in US, APAC and India.\r\n\r\n\r\nWhat we need to see:\r\n\r\nA good degree from a leading university in an engineering or computer science related discipline (BS; MS or PhD preferred).\r\n\r\nYou have fundamental knowledge on SoC architectures and on-chip components.\r\n\r\nStrong knowledge of C/C++, QNX and/or Linux OS.\r\n\r\nYou have extensive knowledge and hands on experience in development of middleware software (scheduler, diagnostics, OTA, time synchronization, SW update etc) as part of AD platform.\r\n\r\nYou have working knowledge of Adaptive AUTOSAR and/or classic AUTOSAR stacks.\r\n\r\nYou should have been working in software development in complex automotive systems.\r\n\r\nGood communication and organization skills, with a logical approach to problem solving, good time management and task prioritization skills.\r\n\r\nWays to stand out from the crowd:\r\n\r\nYou have experience in automotive SW middleware frameworks.\r\n\r\nYou have experience with Automotive SPICE and/or ISO26262 standards.\r\n\r\nYou have extensively supported customers both onsite and offsite.\r\n\r\nYou are self-motivated and work effectively across different functional teams.\r\n\r\nWith highly competitive salaries and a comprehensive benefits package, NVIDIA is widely considered to be one of the technology industry's most desirable employers. We have some of the most brilliant and talented people on the planet working with us and our engineering teams are expanding fast. If you're a creative and autonomous computer scientist with a genuine passion for parallel computing, we want to hear from you.\r\n\r\n\r\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most brilliant and talented people on the planet working for us. If you're creative and autonomous, we want to hear from you!", "is_open": true, "project": 1, "skills": [6, 9, 10, 11, 12, 13, 14]}}, {"model": "nv_projects.nvopenposition", "pk": 5, "fields": {"name": "Semiconductor LASER Expert", "description": "We are looking for a Semiconductor Laser Specialist for the product engineering group to be based in Israel or Gothenburg (Sweden) or Ulm (Germany).\r\n\r\nExperience and knowledge in design, epitaxial growth and fabrication of lasers and photodiodes for fiber optic communication is required.\r\n\r\nWhat you'll be doing:\r\n\r\nCome and take a significant part in designing and verifying our groundbreaking and innovating optical device, enjoy working in a substantial, and growing\r\n\r\nenvironment where you make a huge impact in a technology-focused company.\r\n\r\nIn this position you will join Nvidia product engineering team to build and lead a high-performance engineering team delivering the next generation of electro optical devices for high speed communication in data centers.\r\n\r\nWe design, develop, and deliver optical components using product engineering methodologies for groundbreaking data centers interconnection\r\n\r\nWhat we need to see:\r\n\r\nMSc or PhD degree in Electrical Engineering or Physics or related degree in an engineering field\r\n\r\nSignificant experience in development and integration of semiconductors\r\n\r\nLASERS or photodetectors (or an advanced degree with equivalent experience)\r\n\r\nConfirmed practical experience with electro optical High speed device characterization for optical communication is advantage.\r\n\r\nNVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us. Are you a creative and autonomous engineer who loves a challenge? Are you ready to become the engineer you always wanted to be?", "is_open": true, "project": 1, "skills": [5, 6, 14, 15, 28]}}, {"model": "nv_projects.nvopenposition", "pk": 6, "fields": {"name": "AI Developer Technology Engineer", "description": "NVIDIA is looking for a passionate, world-class computer scientist to work in its Compute Developer Technology (Devtech) team as an AI Developer Technology Engineer.\r\n\r\nWhat you will be doing:\r\n\r\nStudy and develop cutting-edge techniques in deep learning, graphs, machine learning, and data analytics, and perform in-depth analysis and optimization to ensure the best possible performance on current- and next-generation GPU architectures.\r\nWork directly with key customers to understand the current and future problems they are solving and provide the best AI solutions using GPUs.\r\nCollaborate closely with the architecture, research, libraries, tools, and system software teams at NVIDIA to influence the design of next-generation architectures, software platforms, and programming models.", "is_open": true, "project": 4, "skills": [6, 25, 27]}}, {"model": "nv_projects.nvidea", "pk": 1, "fields": {"subject": "LightPerception", "description": "By rearranging and reprocessing data labels, an improved training dataset can be produced to expand and improve the DNN’s capabilities without costly relabeling efforts.", "project": 5, "user": 1, "in_archive": false}}, {"model": "nv_projects.nvidea", "pk": 2, "fields": {"subject": "SlowMotion", "description": "Predict extra frames using CNNs ....", "project": 6, "user": 1, "in_archive": false}}, {"model": "nv_projects.nvidea", "pk": 3, "fields": {"subject": "LandmarkLocalization", "description": "Proposed a novel training procedure based on semi-supervised learning that allows exploring images without ground-truth landmarks to improve the accuracy of the model.", "project": 7, "user": 1, "in_archive": false}}]